# loading data with pandas

In [1]:
import pandas as pd

In [20]:
# initialise data of in the form of list
data = {'Name':['Tom', 'Michael', 'David','Brenda','Rachel','April' ] , 'Age': [20,20,19,18,20,22],'Height in cms':[170,177,179,166,150,163],'Weight':[55,54,60,48,54,61]}

In [4]:
#create a data frame
df = pd.DataFrame(data)

In [6]:
df

      Name  Age  Height in cms  Weight
0      Tom   20            170      55
1  Michael   20            177      54
2    David   19            179      60
3   Brenda   18            166      48
4   Rachel   20            150      54
5    April   22            163      61

In [12]:
#accessing column Weight

x=df[['Weight']]

In [13]:
x

   Weight
0      55
1      54
2      60
3      48
4      54
5      61

# viewing and accessing data

In [14]:
#accessing multiple columns

y = df[['Name','Age','Height in cms']]

In [15]:
y

      Name  Age  Height in cms
0      Tom   20            170
1  Michael   20            177
2    David   19            179
3   Brenda   18            166
4   Rachel   20            150
5    April   22            163

In [16]:
#access the value on the first row and second column

df.iloc[0,1]

20

In [17]:
#access a column using any name

df.loc[1,'Age']

20

In [19]:
df.loc[5,'Weight']

61

# slicing the dataframe

In [25]:
df.iloc[0:4,2:6]

   Height in cms  Weight
0            170      55
1            177      54
2            179      60
3            166      48

In [27]:
df.iloc[0:5,1:7]

   Age  Height in cms  Weight
0   20            170      55
1   20            177      54
2   19            179      60
3   18            166      48
4   20            150      54

In [28]:
#slicing the dataframe using specific column names

df.loc[1:5,'Age':'Weight']

   Age  Height in cms  Weight
1   20            177      54
2   19            179      60
3   18            166      48
4   20            150      54
5   22            163      61